PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_cryptolite_aes_ccm.c
/***************************************************************************//**
* \file cy_cryptolite_aes_ccm.c
* \version 2.80
*
* \brief
*  Provides API implementation of the Cryptolite AES CCM PDL driver.
*
********************************************************************************
* \copyright
* Copyright (c) 2023, Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*    http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include "cy_device.h"

#if defined (CY_IP_MXCRYPTOLITE)

#include "cy_cryptolite_aes_ccm.h"

#if defined(__cplusplus)
extern "C" {
#endif


#if (CRYPTOLITE_AES_PRESENT == 1)
#if defined(CY_CRYPTOLITE_CFG_CIPHER_MODE_CCM)

/*******************************************************************************
* Function Name: Cy_Cryptolite_Aes_Ccm_Init
****************************************************************************//*
*
* Performs an AES CCM Init operation.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param aesCcm_buffer The buffers should be a SAHB mapped addresses.
* The pointer to the memory buffers storage.
*
* \param aesState
* The pointer to the AES CCM state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/

cy_en_cryptolite_status_t Cy_Cryptolite_Aes_Ccm_Init(CRYPTOLITE_Type *base,
        cy_stc_cryptolite_aes_ccm_buffers_t *aesCcm_buffer, cy_stc_cryptolite_aes_ccm_state_t *aesCcmState)
{
    /* Input parameters verification */
    if ((NULL == base) || (NULL == aesCcm_buffer) || (NULL == aesCcmState))
    {
        return CY_CRYPTOLITE_BAD_PARAMS;
    }

    Cy_Cryptolite_Vu_memset((void *)aesCcm_buffer, 0u, sizeof(cy_stc_cryptolite_aes_ccm_buffers_t));
    Cy_Cryptolite_Vu_memset((void *)aesCcmState, 0u, sizeof(cy_stc_cryptolite_aes_ccm_state_t));

    aesCcmState->aesCbcMacState.buffers = &aesCcm_buffer->aesCbcMac_buffer;
    aesCcmState->aesCtrState.buffers = &aesCcm_buffer->aesCtr_buffer;
    aesCcmState->temp = aesCcm_buffer->temp_buffer;
    aesCcmState->ctr = aesCcm_buffer->ctr;
    aesCcmState->y = aesCcm_buffer->y;

    return CY_CRYPTOLITE_SUCCESS;
}



/*******************************************************************************
* Function Name: Cy_Cryptolite_Aes_Ccm_SetKey
****************************************************************************//*
*
* Sets AES CCM Key for the operation.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param key
* The pointer to the CCM key.
*
* \param aesCcmState
* The pointer to the AES CCM state structure allocated by the user. The user
* must not modify anything in this structure.
*
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_Aes_Ccm_SetKey(CRYPTOLITE_Type *base,
        uint8_t const *key, cy_stc_cryptolite_aes_ccm_state_t *aesCcmState)
{
    cy_en_cryptolite_status_t status = CY_CRYPTOLITE_BAD_PARAMS;
    uint8_t *keyRemap;

    /* Input parameters verification */
    if ((NULL == base) || (NULL == key) || (NULL == aesCcmState))
    {
        return CY_CRYPTOLITE_BAD_PARAMS;
    }

    keyRemap = (uint8_t *)CY_REMAP_ADDRESS_CRYPTOLITE(key);

    // Sets the AES Key for the CBC MAC operation
    status = Cy_Cryptolite_Aes_Init(base, keyRemap, &aesCcmState->aesCbcMacState, aesCcmState->aesCbcMacState.buffers);
    if (CY_CRYPTOLITE_SUCCESS != status)
    {
        return status;
    }

    // Sets the AES Key for the CTR operation
    status = Cy_Cryptolite_Aes_Init(base, keyRemap, &aesCcmState->aesCtrState, aesCcmState->aesCtrState.buffers);
    if (CY_CRYPTOLITE_SUCCESS != status)
    {
        return status;
    }

    return CY_CRYPTOLITE_SUCCESS;
}



/*******************************************************************************
* Function Name: Cy_Cryptolite_Aes_Ccm_Initial_Block
****************************************************************************//*
*
*  Performs the Initial CCM calculation.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param aesCcmState
* The pointer to the AES CCM state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/
static cy_en_cryptolite_status_t Cy_Cryptolite_Aes_Ccm_Initial_Block(CRYPTOLITE_Type *base,
        cy_stc_cryptolite_aes_ccm_state_t *aesCcmState)
{
    cy_en_cryptolite_status_t status = CY_CRYPTOLITE_BAD_PARAMS;
    uint32_t size_left = 0u;

    if (aesCcmState->isIvSet == false || aesCcmState->isLengthSet == false)
    {
        return CY_CRYPTOLITE_SUCCESS;
    }

    status = Cy_Cryptolite_Aes_CbcMac_Setup(base, &aesCcmState->aesCbcMacState);
    if (CY_CRYPTOLITE_SUCCESS != status)
    {
        return status;
    }

    aesCcmState->y[0] |= (uint8_t)(aesCcmState->aadLength > 0u) << 6u;
    aesCcmState->y[0] |= ((aesCcmState->tagLength - 2u) / 2u) << 3u;
    aesCcmState->y[0] |= (uint8_t)aesCcmState->L - 1u;

    size_left = aesCcmState->textLength;
    for (uint32_t i = 0u; i < aesCcmState->L; i++)
    {
        aesCcmState->y[15u - i] = (uint8_t)size_left & 0xffu ;
        size_left >>= 8u;
    }

    // Performs the CBC MAC update operation for the Initial Block data formatted with flags and length
    status = Cy_Cryptolite_Aes_CbcMac_Update(base, CY_CRYPTOLITE_AES_BLOCK_SIZE, aesCcmState->y, &aesCcmState->aesCbcMacState);
    if (CY_CRYPTOLITE_SUCCESS != status)
    {
        return status;
    }

