PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_cryptolite_aes_ccm.c
    if (aesCcmState->aadLength > 0u)
    {
        aesCcmState->temp[0] = (uint8_t)(aesCcmState->aadLength >> 8u) & 0xffu;
        aesCcmState->temp[1] = (uint8_t)(aesCcmState->aadLength & 0xffu);
        status = Cy_Cryptolite_Aes_CbcMac_Update(base, 2u, aesCcmState->temp, &aesCcmState->aesCbcMacState);

        if (CY_CRYPTOLITE_SUCCESS != status)
        {
            return status;
        }

        aesCcmState->aadLengthProcessed += 2u;
    }

    return CY_CRYPTOLITE_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_Cryptolite_Aes_Ccm_Set_Length
****************************************************************************//*
*
* Sets the length for Additional authentication data, plain text and Tag for AES CCM operation.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param aadSize
* The Size of the Additional Authentication Data.
*
* \param textSize
* The Size of the Text.
*
* \param tagLength
* The Size of the Tag.
*
* \param aesCcmState
* The pointer to the AES CCM state structure allocated by the user. The user
* must not modify anything in this structure.
*
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_Aes_Ccm_Set_Length(CRYPTOLITE_Type *base,
        uint32_t aadSize,  uint32_t textSize, uint32_t tagLength,
        cy_stc_cryptolite_aes_ccm_state_t *aesCcmState)
{
    /* Input parameters verification */
    if ((NULL == base) || (NULL == aesCcmState))
    {
        return CY_CRYPTOLITE_BAD_PARAMS;
    }

    if (tagLength < 3u || tagLength > CY_CRYPTOLITE_AES_BLOCK_SIZE || (tagLength % 2u != 0u))
    {
        return CY_CRYPTOLITE_BAD_PARAMS;
    }

    if (aadSize >= 0xFF00UL)
    {
        return CY_CRYPTOLITE_BAD_PARAMS;
    }

    aesCcmState->textLength = textSize;
    aesCcmState->aadLength = aadSize;
    aesCcmState->tagLength = (uint8_t)tagLength;
    aesCcmState->aadLengthProcessed = 0u;
    aesCcmState->isAadProcessed = false;
    aesCcmState->isLengthSet = true;

    return Cy_Cryptolite_Aes_Ccm_Initial_Block(base, aesCcmState);
}


/*******************************************************************************
* Function Name: Cy_Cryptolite_Aes_Ccm_Start
****************************************************************************//*
*
* Function to set IV for the AES CCM operation.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param dirMode
* Can be \ref CY_CRYPTOLITE_ENCRYPT or \ref CY_CRYPTOLITE_DECRYPT
* (\ref cy_en_cryptolite_dir_mode_t)
*
* \param ivSize
* The size of the IV.
*
* \param iv
* The pointer to the IV.
*
* \param aesCcmState
* The pointer to the AES CCM state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/

cy_en_cryptolite_status_t Cy_Cryptolite_Aes_Ccm_Start(CRYPTOLITE_Type *base,
        cy_en_cryptolite_dir_mode_t dirMode,
        uint32_t ivSize, uint8_t const * iv,
        cy_stc_cryptolite_aes_ccm_state_t *aesCcmState)
{
    cy_en_cryptolite_status_t status = CY_CRYPTOLITE_BAD_PARAMS;
    uint8_t *ivRemap;

    /* Input parameters verification */
    if ((NULL == base) || (NULL == iv) || (NULL == aesCcmState))
    {
        return status;
    }

    if (ivSize < 7u || ivSize > 13u)
    {
        return status;
    }

    ivRemap = (uint8_t *)CY_REMAP_ADDRESS_CRYPTOLITE(iv);

    aesCcmState->dirMode = dirMode;
    aesCcmState->L = CY_CRYPTOLITE_AES_BLOCK_SIZE - ivSize - 1u;
    aesCcmState->isIvSet = true;

    Cy_Cryptolite_Vu_memset(aesCcmState->ctr, 0u, CY_CRYPTOLITE_AES_BLOCK_SIZE);
    aesCcmState->ctr[0] = (uint8_t)aesCcmState->L - 1u;
    aesCcmState->ctr[15] = 1u;
    Cy_Cryptolite_Vu_memcpy((void*)&aesCcmState->ctr[1], (void*)ivRemap, (uint16_t)ivSize);

    Cy_Cryptolite_Vu_memset(aesCcmState->y, 0u, CY_CRYPTOLITE_AES_BLOCK_SIZE);
    Cy_Cryptolite_Vu_memcpy((void*)&aesCcmState->y[1], (void*)ivRemap, (uint16_t)ivSize);


    // Sets the IV for the AES CTR operation
    status = Cy_Cryptolite_Aes_Ctr_Setup(base, &aesCcmState->aesCtrState);
    if (CY_CRYPTOLITE_SUCCESS != status)
    {
        return status;
    }

    status = Cy_Cryptolite_Aes_Ctr_Set_IV(base, aesCcmState->ctr, &aesCcmState->aesCtrState);
    if (CY_CRYPTOLITE_SUCCESS != status)
    {
        return status;
    }

    return Cy_Cryptolite_Aes_Ccm_Initial_Block(base, aesCcmState);
}



/*******************************************************************************
* Function Name: Cy_Cryptolite_Aes_Ccm_Update_Aad
****************************************************************************//*
*
* Performs an AES CCM update AAD Multistage  operation.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param aadSize
* The size of the AAD.
*
* \param aad
* The pointer to a AAD.
*
* \param aesCcmState
* The pointer to the AES CCM state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_Aes_Ccm_Update_Aad(CRYPTOLITE_Type *base,
        uint32_t aadSize,
        uint8_t const *aad,
        cy_stc_cryptolite_aes_ccm_state_t *aesCcmState)


{
    cy_en_cryptolite_status_t status = CY_CRYPTOLITE_BAD_PARAMS;
    uint8_t *aadRemap;

    if (0u == aadSize)
    {
        return CY_CRYPTOLITE_SUCCESS;
    }

    if (aadSize >= 0xFF00UL)
    {
        return CY_CRYPTOLITE_BAD_PARAMS;
    }

    /* Input parameters verification */
    if ((NULL == base) || (NULL == aesCcmState) || (NULL == aad))
    {
        return CY_CRYPTOLITE_BAD_PARAMS;
    }

    aadRemap = (uint8_t *)CY_REMAP_ADDRESS_CRYPTOLITE(aad);

    status = Cy_Cryptolite_Aes_CbcMac_Update(base, aadSize, aadRemap, &aesCcmState->aesCbcMacState);
    if (CY_CRYPTOLITE_SUCCESS != status)
    {
        return status;
    }

    aesCcmState->aadLengthProcessed += aadSize;

