PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_cryptolite_aes_ccm.c
    return status;
}


/*******************************************************************************
* Function Name: Cy_Cryptolite_Aes_Ccm_Update
****************************************************************************//*
*
* Performs an AES CCM Update Multistage update operation.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param srcSize
* The size of the source block.
*
* \param dst
* The pointer to a destination block.
*
* \param src
* The pointer to a source block.
*
* \param aesCcmState
* The pointer to the AES CCM state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_Aes_Ccm_Update(CRYPTOLITE_Type *base,
        uint32_t srcSize,
        uint8_t *dst,
        uint8_t const *src,
        cy_stc_cryptolite_aes_ccm_state_t *aesCcmState)


{
    cy_en_cryptolite_status_t status = CY_CRYPTOLITE_BAD_PARAMS;
    uint8_t *temp = NULL;
    uint8_t *cipherText_ptr;
    uint8_t *srcRemap;

    if (0u == srcSize)
    {
        return CY_CRYPTOLITE_SUCCESS;
    }

    /* Input parameters verification */
    if ((NULL == base) || (NULL == aesCcmState) || (NULL == dst) || (NULL == src))
    {
        return CY_CRYPTOLITE_BAD_PARAMS;
    }

    temp = aesCcmState->temp;


    srcRemap = (uint8_t *)CY_REMAP_ADDRESS_CRYPTOLITE(src);

    Cy_Cryptolite_Vu_memset(temp, 0u, CY_CRYPTOLITE_AES_BLOCK_SIZE);

    if (aesCcmState->aadLengthProcessed % CY_CRYPTOLITE_AES_BLOCK_SIZE != 0u && aesCcmState->isAadProcessed == false)
    {
        status = Cy_Cryptolite_Aes_CbcMac_Update(base,  CY_CRYPTOLITE_AES_BLOCK_SIZE - aesCcmState->aadLengthProcessed % CY_CRYPTOLITE_AES_BLOCK_SIZE, temp, &aesCcmState->aesCbcMacState);
        if (CY_CRYPTOLITE_SUCCESS != status)
        {
            return status;
        }

        aesCcmState->isAadProcessed = true;
    }

    status =  Cy_Cryptolite_Aes_Ctr_Update(base, srcSize, dst, srcRemap, &aesCcmState->aesCtrState);
    if (CY_CRYPTOLITE_SUCCESS != status)
    {
        return status;
    }

    if (aesCcmState->dirMode == CY_CRYPTOLITE_ENCRYPT)
    {
        cipherText_ptr = (uint8_t *)srcRemap;
    }
    else
    {
        cipherText_ptr = dst;
    }

    status = Cy_Cryptolite_Aes_CbcMac_Update(base, srcSize, cipherText_ptr, &aesCcmState->aesCbcMacState);

    return status;
}



/*******************************************************************************
* Function Name: Cy_Cryptolite_Aes_Ccm_Finish
****************************************************************************//*
*
* Performs an AES CCM finish operation.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param mac
* The pointer to the CCM Tag.
*
* \param aesCcmState
* The pointer to the AES CCM state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_Aes_Ccm_Finish(CRYPTOLITE_Type *base, uint8_t *tag, cy_stc_cryptolite_aes_ccm_state_t *aesCcmState)
{
    uint8_t *temp = NULL;
    uint8_t y[CY_CRYPTOLITE_AES_BLOCK_SIZE] = {0u};
    cy_en_cryptolite_status_t status = CY_CRYPTOLITE_BAD_PARAMS;

    /* Input parameters verification */
    if ((NULL == base) || (NULL == aesCcmState))
    {
        return CY_CRYPTOLITE_BAD_PARAMS;
    }

    temp = aesCcmState->temp;

    Cy_Cryptolite_Vu_memset(temp, 0u, CY_CRYPTOLITE_AES_BLOCK_SIZE);
    Cy_Cryptolite_Vu_memset(y, 0u, CY_CRYPTOLITE_AES_BLOCK_SIZE);

    if (aesCcmState->aadLengthProcessed % CY_CRYPTOLITE_AES_BLOCK_SIZE != 0u && aesCcmState->isAadProcessed == false)
    {
        status = Cy_Cryptolite_Aes_CbcMac_Update(base,  CY_CRYPTOLITE_AES_BLOCK_SIZE - aesCcmState->aadLengthProcessed % CY_CRYPTOLITE_AES_BLOCK_SIZE, temp, &aesCcmState->aesCbcMacState);
        if (CY_CRYPTOLITE_SUCCESS != status)
        {
            return status;
        }
    }

    if (aesCcmState->textLength % CY_CRYPTOLITE_AES_BLOCK_SIZE  != 0u)
    {
        status = Cy_Cryptolite_Aes_CbcMac_Update(base, CY_CRYPTOLITE_AES_BLOCK_SIZE - aesCcmState->textLength % CY_CRYPTOLITE_AES_BLOCK_SIZE, temp, &aesCcmState->aesCbcMacState);
        if (CY_CRYPTOLITE_SUCCESS != status)
        {
            return status;
        }
    }

    status = Cy_Cryptolite_Aes_CbcMac_Finish(base, temp, &aesCcmState->aesCbcMacState);
    if (CY_CRYPTOLITE_SUCCESS != status)
    {
        return status;
    }

    for (uint32_t i = 0u; i < aesCcmState->L; i++)
    {
        aesCcmState->aesCtrState.buffers->iv[15u-i] = 0u;
    }

    aesCcmState->aesCtrState.unProcessedBytes = 0u;

    status = Cy_Cryptolite_Aes_Ctr_Update(base, CY_CRYPTOLITE_AES_BLOCK_SIZE,
                                          y,
                                          temp,
                                          &aesCcmState->aesCtrState);

    if (CY_CRYPTOLITE_SUCCESS != status)
    {
        return status;
    }

    Cy_Cryptolite_Vu_memcpy((void*)tag, (void*)y, aesCcmState->tagLength);
    Cy_Cryptolite_Vu_memset(aesCcmState->ctr, 0u, CY_CRYPTOLITE_AES_BLOCK_SIZE);
    Cy_Cryptolite_Vu_memset(aesCcmState->y, 0u, CY_CRYPTOLITE_AES_BLOCK_SIZE);
    aesCcmState->isIvSet = false;
    aesCcmState->isAadProcessed = false;

    return status;
}



/*******************************************************************************
* Function Name: Cy_Cryptolite_Aes_Ccm
****************************************************************************//*
*
* Performs an AES CCM operation.
* \note Cy_Cryptolite_Aes_Ccm_Init() and Cy_Cryptolite_Aes_Ccm_SetKey() should be called before calling this function.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param dirMode
* Can be \ref CY_CRYPTOLITE_ENCRYPT or \ref CY_CRYPTOLITE_DECRYPT
* (\ref cy_en_cryptolite_dir_mode_t)
*
* \param ivSize
* The size of the IV.
*
* \param iv
* The pointer to the IV.
*
* \param aadSize
* The size of the AAD.
*
* \param aad
* The pointer to a AAD.
*
* \param srcSize
* The size of the source block.
*
* \param dst
* The pointer to a destination block.
*
* \param src
* The pointer to a source block.
*
* \param tagSize
* The size of the Tag.
*
* \param tag
* The pointer to the tags.
*
* \param aesCcmState
* The pointer to the AES CCM state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/
static cy_en_cryptolite_status_t Cy_Cryptolite_Aes_Ccm(CRYPTOLITE_Type *base,
        cy_en_cryptolite_dir_mode_t dirMode,
        uint32_t ivSize, uint8_t const * iv,
        uint32_t aadSize, uint8_t const *aad,
        uint32_t srcSize, uint8_t *dst, uint8_t const *src,
        uint32_t tagSize, uint8_t *tag,
        cy_stc_cryptolite_aes_ccm_state_t *aesCcmState)

{
    cy_en_cryptolite_status_t status = CY_CRYPTOLITE_BAD_PARAMS;
    uint8_t *ivRemap;
    uint8_t *aadRemap;
    uint8_t *srcRemap;

    /* Input parameters verification */
    if ((NULL == base) || ((NULL == iv) && (ivSize > 0u)) || ((NULL == aad) && (aadSize > 0u)) ||
            ((srcSize > 0u) && ((NULL == dst) || (NULL == src))) || (NULL == aesCcmState) || (NULL == tag))
    {
        return status;
    }

    ivRemap = (uint8_t *)CY_REMAP_ADDRESS_CRYPTOLITE(iv);
    aadRemap = (uint8_t *)CY_REMAP_ADDRESS_CRYPTOLITE(aad);
    srcRemap = (uint8_t *)CY_REMAP_ADDRESS_CRYPTOLITE(src);

    status = Cy_Cryptolite_Aes_Ccm_Set_Length(base, aadSize,  srcSize, tagSize, aesCcmState);

    if (CY_CRYPTOLITE_SUCCESS != status)
    {
        return status;
    }

    status = Cy_Cryptolite_Aes_Ccm_Start(base, dirMode, ivSize, ivRemap, aesCcmState);

    if (CY_CRYPTOLITE_SUCCESS != status)
    {
        return status;
    }

