PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_cryptolite_aes_ccm.c
    status = Cy_Cryptolite_Aes_Ccm_Update_Aad(base, aadSize, aadRemap, aesCcmState);

    if (CY_CRYPTOLITE_SUCCESS != status)
    {
        return status;
    }

    status = Cy_Cryptolite_Aes_Ccm_Update(base, srcSize, dst, srcRemap, aesCcmState);

    if (CY_CRYPTOLITE_SUCCESS != status)
    {
        return status;
    }

    status = Cy_Cryptolite_Aes_Ccm_Finish(base, tag, aesCcmState);

    return status;
}




/*******************************************************************************
* Function Name: Cy_Cryptolite_Aes_Ccm_Encrypt_Tag
****************************************************************************//*
*
* Performs an AES CCM Encrypt operation.
* \note Cy_Cryptolite_Aes_Ccm_Init() and Cy_Cryptolite_Aes_Ccm_SetKey() should be called before calling this function
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param ivSize
* The size of the IV.
*
* \param iv
* The pointer to the IV.
*
* \param aadSize
* The size of the AAD.
*
* \param aad
* The pointer to a AAD.
*
* \param srcSize
* The size of the source block.
*
* \param cipherTxt
* The pointer to a cipher text block.
*
* \param plainTxt
* The pointer to a plain text block.
*
* \param tagSize
* The size of the Tag.
*
* \param tag
* The pointer to the tags.
*
* \param aesCcmState
* The pointer to the AES CCM state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_Aes_Ccm_Encrypt_Tag(CRYPTOLITE_Type *base,
        uint32_t ivSize, uint8_t const * iv,
        uint32_t aadSize, uint8_t const *aad,
        uint32_t srcSize, uint8_t *cipherTxt, uint8_t const *plainTxt,
        uint32_t tagSize, uint8_t *tag,
        cy_stc_cryptolite_aes_ccm_state_t *aesCcmState)

{

    return Cy_Cryptolite_Aes_Ccm(base, CY_CRYPTOLITE_ENCRYPT, ivSize, iv, aadSize, aad,
                                 srcSize, cipherTxt, plainTxt, tagSize, tag,
                                 aesCcmState);
}


/*******************************************************************************
* Function Name: Cy_Cryptolite_Aes_Ccm_Decrypt
****************************************************************************//*
*
* Performs an AES CCM Decrypt operation.
* \note Cy_Cryptolite_Aes_Ccm_Init() and Cy_Cryptolite_Aes_Ccm_SetKey() should be called before calling this function
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param ivSize
* The size of the IV.
*
* \param iv
* The pointer to the IV.
*
* \param aadSize
* The size of the AAD.
*
* \param aad
* The pointer to a AAD.
*
* \param srcSize
* The size of the source block.
*
* \param plainTxt
* The pointer to a plain text block.
*
* \param cipherTxt
* The pointer to a cipher text block.
*
* \param tagSize
* The size of the Tag.
*
* \param tag
* The pointer to the tags.
*
* \param isValid
* The pointer Store the authentication status.
*
* \param aesCcmState
* The pointer to the AES CCM state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_Aes_Ccm_Decrypt(CRYPTOLITE_Type *base,
        uint32_t ivSize, uint8_t const * iv,
        uint32_t aadSize, uint8_t const *aad,
        uint32_t srcSize, uint8_t *plainTxt, uint8_t const *cipherTxt,
        uint32_t tagSize, uint8_t *tag, cy_en_cryptolite_ccm_auth_result_t *isValid,
        cy_stc_cryptolite_aes_ccm_state_t *aesCcmState)

{
    cy_en_cryptolite_status_t status = CY_CRYPTOLITE_BAD_PARAMS;
    uint8_t TagCal[CY_CRYPTOLITE_AES_BLOCK_SIZE] = {0u};
    *isValid = CY_CRYPTOLITE_TAG_INVALID;

    status = Cy_Cryptolite_Aes_Ccm(base, CY_CRYPTOLITE_DECRYPT, ivSize, iv, aadSize, aad,
                                   srcSize, (uint8_t *)plainTxt, cipherTxt, tagSize, TagCal,
                                   aesCcmState);
    if (CY_CRYPTOLITE_SUCCESS != status)
    {
        return status;
    }

    if (Cy_Cryptolite_Vu_memcmp(tag, TagCal, tagSize) == 0u)
    {
        *isValid = CY_CRYPTOLITE_TAG_VALID;
    }

    return CY_CRYPTOLITE_SUCCESS;
}



/*******************************************************************************
* Function Name: Cy_Cryptolite_Aes_Ccm_Free
****************************************************************************//*
*
* Clears AES CCM operation context.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param aesCcmState
* The pointer to the AES CCM state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_Aes_Ccm_Free(CRYPTOLITE_Type *base, cy_stc_cryptolite_aes_ccm_state_t *aesCcmState)
{
    (void)base;

    if (NULL != aesCcmState)
    {
        if (NULL != aesCcmState->aesCbcMacState.buffers)
        {
            Cy_Cryptolite_Vu_memset((void *)aesCcmState->aesCbcMacState.buffers, 0u, sizeof(cy_stc_cryptolite_aes_buffers_t));
        }

        if (NULL != aesCcmState->aesCtrState.buffers)
        {
            Cy_Cryptolite_Vu_memset((void *)aesCcmState->aesCtrState.buffers, 0u, sizeof(cy_stc_cryptolite_aes_buffers_t));
        }

        Cy_Cryptolite_Vu_memset((void *)aesCcmState, 0u, sizeof(cy_stc_cryptolite_aes_ccm_state_t));
    }

    return CY_CRYPTOLITE_SUCCESS;
}


#endif /*CY_CRYPTOLITE_CFG_CIPHER_MODE_CCM*/
#endif /*CRYPTOLITE_AES_PRESENT*/

#if defined(__cplusplus)
}
#endif


#endif /* CY_IP_MXCRYPTOLITE */


/* [] END OF FILE */
